*** importing self updating csv files
There is a way to import csv file as table in org mode!
Like this, you just need to execute all code blocks

(C-c C-v C-b org-babel-execute-buffer)

To update all the tables!! You can even have a bash code block that
copies the tables in their origin directory to the .org directory like
so:

#+begin_src bash
cp sourcefile outputfile
#+end_src

(look at [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html][this tutorial]] to understand everything done here)

#+name: panda2org
#+begin_src python :var df="df" :exports none
  return f"return tabulate({df}, headers={df}.columns, tablefmt='orgtbl')"
#+end_src

#+header: :prologue from tabulate import tabulate
#+header: :noweb strip-export
#+begin_src python :results value raw :exports results
  import pandas as pd
  filename = "/home/mehdi/dossiers/ilm/mesures_brevet_condense/rapport/atelier/archive/metals_csv_young.csv"
  df = pd.read_csv(filename, index_col=0)

  <<panda2org("df")>>
#+end_src

#+RESULTS:
|                | Module de Young | Intervalle de confiance (95%) |
|----------------+-----------------+-------------------------------|
| acier 304-L    |           169.3 |                             9 |
| aluminium AG5  |            69.4 |                           3.3 |
| aluminium AU4G |            67.2 |                           4.2 |
| cuivre         |             103 |                            15 |
| laiton         |            94.6 |                           8.8 |
| nickel         |             218 |                            14 |
| titane T6AV    |           116.9 |                           4.4 |
| tantale        |             192 |                            16 |
| molybdène      |             300 |                           120 |
| fonte          |           151.7 |                           9.1 |

\newpage

